app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id] || current_user.id)
    if @user.community_id == 0
      redirect_to full_listing_path
    else
      @page_title = @user.name
      @community_users = User.where(:community_id => @user.community.id).order(:role_id, :name)
---
SELECT `ecc_users`.* FROM `ecc_users` WHERE `ecc_users`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`community_id` = 16 ORDER BY role_id, name

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `ecc_users` (`name`, `email`, `phone`, `postal_code`, `community_league_member`, `newsletter_signup`, `role_id`, `community_id`, `encrypted_password`, `salt`, `created_at`, `updated_at`) VALUES ('Sherman', 'random@e19.ca', '7807091280', 't6l3z3', 1, 1, NULL, NULL, '7ea101c3d6fcc716c9b33363b5aa7941d9e585178647cc387423b8af6369f933', '362bf0a5e50ff8ca01d38c0ec9f1bc41ac58fe17ce31ab16aebc3c8edb14f153', '2011-04-11 13:39:25', '2011-04-11 13:39:25')

  def edit
    @page_title = "Edit user"
    @user = User.find(params[:id])
---
SELECT `ecc_users`.* FROM `ecc_users` WHERE `ecc_users`.`id` IS NULL LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT `ecc_users`.* FROM `ecc_users` WHERE `ecc_users`.`id` = 2 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `ecc_users` SET `name` = 'Sherman Tsang', `updated_at` = '2011-04-11 15:50:51' WHERE `ecc_users`.`id` = 2
UPDATE `users` SET `postal_code` = 'T6L3Z3', `encrypted_password` = '27722901802fa35372fb38a953e95004ca4cb5943233d04ca59caa2f36c02855', `updated_at` = '2011-04-12 09:30:11' WHERE `users`.`id` = 1